
// ====== LOCAL STORAGE FALLBACK ENGINE ======
const MOCK_STORAGE_KEY = 'store_app_local_data_v25';

function getInitialLocalData() {
  return {
    settings: { appTitle: 'Store Manager V1' },
    locations: [
  {
    "name": "สโตร์พงษ์เพชร",
    "type": "สโตร์",
    "col": 6,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "สโตร์ออฟฟิศ",
    "type": "สโตร์",
    "col": 7,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "สโตร์รัตนา",
    "type": "สโตร์",
    "col": 8,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "สโตร์ไทรน้อย",
    "type": "สโตร์",
    "col": 9,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "เอกมัย",
    "type": "ไซต์งาน",
    "col": 10,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "วอลโว่",
    "type": "ไซต์งาน",
    "col": 11,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "งานซ่อม",
    "type": "ไซต์งาน",
    "col": 12,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "กบินทร์บุรี",
    "type": "ไซต์งาน",
    "col": 13,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "โกดังพี่เบิ้ล",
    "type": "ไซต์งาน",
    "col": 14,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "โรงเรียนแนช",
    "type": "ไซต์งาน",
    "col": 15,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "โตโยต้า นครพิงค์",
    "type": "ไซต์งาน",
    "col": 16,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "เช่า",
    "type": "ไซต์งาน",
    "col": 17,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "ร้านซ่อม",
    "type": "อื่นๆ",
    "col": 18,
    "archived": false,
    "hideCount": false
  },
  {
    "name": "สูญหาย",
    "type": "อื่นๆ",
    "col": 18,
    "archived": false,
    "hideCount": false
  }
],
    items: [
  {
    "row": 6,
    "category": "Safety",
    "name": "เข็มขัดเซฟตี้",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 5,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 7,
    "category": "Safety",
    "name": "เสื้อสะท้อนแสง",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 8,
    "category": "Safety",
    "name": "ผ้ากันสะเก็ดไฟ",
    "unit": "ผืน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 9,
    "category": "Safety",
    "name": "ถังดับเพลิง",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 2,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 10,
    "category": "Safety",
    "name": "หมวกเซฟตี้",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 11,
    "category": "Safety",
    "name": "แมสชีส 1.80x5.10 ม.",
    "unit": "ผืน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 40,
      "สโตร์รัตนา": 175,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -18,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 8,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 12,
    "category": "Safety",
    "name": "บลูชีส",
    "unit": "ผืน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "ข้อมูลไม่ใช่"
  },
  {
    "row": 13,
    "category": "Site",
    "name": "แผ่นเหล็กปูทาง 1.2*2.4",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 5,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 14,
    "category": "Site",
    "name": "ถังน้ำ 200 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 5,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 15,
    "category": "Site",
    "name": "ถังเก็บน้ำ 500 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 16,
    "category": "Site",
    "name": "ถังเก็บน้ำ 1000 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 4,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 17,
    "category": "Site",
    "name": "ถังเก็บน้ำ 2000 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 18,
    "category": "Site",
    "name": "ห้องน้ำสนาม",
    "unit": "ห้อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 19,
    "category": "Site",
    "name": "ห้องน้ำสนาม 2 ห้อง",
    "unit": "ตู้",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 20,
    "category": "Site",
    "name": "ตู้สนาม(ตู้คอนเทนเนอร์)",
    "unit": "ตู้",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 21,
    "category": "Site",
    "name": "ตู้สโตร์",
    "unit": "ตู้",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 22,
    "category": "Site",
    "name": "ผ้าใบเคลือบ คลุมวัสดุ 4x6  (สีฟ้า)",
    "unit": "ผืน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 3,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 3,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 3,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 23,
    "category": "Site",
    "name": "ชุดเต๊น ผ้าใบ + ขา",
    "unit": "หลัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 3,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 24,
    "category": "Survey",
    "name": "ไม้สตาฟ",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 25,
    "category": "Survey",
    "name": "กล้อง total station",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 26,
    "category": "Survey",
    "name": "เลเซอร์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 27,
    "category": "Survey",
    "name": "กล้องระดับ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 28,
    "category": "Survey",
    "name": "เทปวัดระยะ 50 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 29,
    "category": "Survey",
    "name": "ขาตั้งกล้อง",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 3,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 30,
    "category": "Survey",
    "name": "ปริซึม เล็ก +ขาตั้ง",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 31,
    "category": "Survey",
    "name": "ปริซึม ใหญ่ + ขาตั้ง",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 32,
    "category": "Survey",
    "name": "วิทยุสื่อสาร",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 6,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 7,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "รอซ่อม"
  },
  {
    "row": 33,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กเส้นข้ออ้อย*6 มม ยาว 10 ม",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 34,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กเส้นข้ออ้อย*12 มม ยาว 10 ม",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 35,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็ก c 5*2 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 20,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 36,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็ก c 6*2 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 2,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 37,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็ก c 6*3 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 38,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็ก c4*2 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 2,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 39,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กแป๊บกลม 1.5 น.ยาว 2.50-3 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -11,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 11,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 40,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กแป๊บกลม 2น.ยาว 2 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 41,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กแป๊บกลม 2น.ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 3,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 42,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กแป๊บกลม 5\" ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 12,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 43,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x1\" 6.00 เมตร",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 44,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" 6.00 เมตร",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 3,
      "เอกมัย": 12,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 107,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 432,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 45,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษ 1.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 160,
      "สโตร์ออฟฟิศ": 624,
      "สโตร์รัตนา": 148,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -35,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 70,
      "โกดังพี่เบิ้ล": 228,
      "โรงเรียนแนช": 358,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 46,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษ 1.50 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 21,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 47,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษ 2.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 48,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 11,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 270,
      "โกดังพี่เบิ้ล": 40,
      "โรงเรียนแนช": 106,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 48,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษ 2.50 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 12,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -12,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 78,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 49,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษ 3.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 30,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 85,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 3,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 50,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x2\" เศษไม่เกิน 1.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 156,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -54,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 186,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 51,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x4\" เศษ 2.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 8,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 52,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2\"x4\" เศษ 3-4 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 3,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 53,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2*4 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 3,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 54,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 2*8 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 2,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 55,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 3\"x3\" ยาว 1.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 56,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 3\"x3\" ยาว 2.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 57,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 3\"x3\" ยาว 6.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 58,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" 6.00 เมตร",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 2,
      "เอกมัย": 2,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 11,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 138,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 59,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" เศษ 1.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 60,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" เศษ 1.50 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 99,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 61,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" เศษ 2.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -5,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": -7,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 24,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 62,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" เศษ 2.50 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 63,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\" เศษ 3.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 18,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 6,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": -4,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 36,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 64,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กกล่อง 4\"x4\"เศษ 4 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 31,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 14,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 65,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กฉาก 4*4 ยาว 4 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 66,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กฉาก 1*1 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 67,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กฉาก 2*2 ยาว 2 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 68,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กฉาก 2*2 ยาว 3 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 69,
    "category": "เหล็กรูปพรรณ",
    "name": "เหล็กฉาก 2*2 ยาว 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": -6,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 6,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 70,
    "category": "เหล็กรูปพรรณ",
    "name": "ฉาก 1*1*6.00",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 71,
    "category": "เหล็กรูปพรรณ",
    "name": "แผ่นเหล็กป้ำลาย",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 72,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส 0.80ยาว 2.10 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 26,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 73,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส ยาว 6 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 74,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส ยาว 2 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 75,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส ยาว 3 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 76,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส ยาว 4 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 77,
    "category": "แคมป์",
    "name": "แผ่นเมทัลชีส ยาว 5 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 78,
    "category": "แคมป์",
    "name": "แผ่นสังกะสี ยาว 2 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 79,
    "category": "แคมป์",
    "name": "แผ่นสังกะสี ยาว 3 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 80,
    "category": "แคมป์",
    "name": "แผ่นสังกะสีเก่า",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 116,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 81,
    "category": "แคมป์",
    "name": "ไม้ยูคา 2\"",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 82,
    "category": "แคมป์",
    "name": "ไม้ยูคา 3\"",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 300,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 83,
    "category": "แคมป์",
    "name": "ไม้ยูคา 4\"",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 84,
    "category": "แคมป์",
    "name": "ไม้ยูคา 50 ซ",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 85,
    "category": "ไฟฟ้า",
    "name": "เบรคเกอร์ IP 50 A",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 86,
    "category": "ไฟฟ้า",
    "name": "มิเตอร์ประปา",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 87,
    "category": "ไฟฟ้า",
    "name": "มิเตอร์ไฟฟ้า 15 แอมป์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 88,
    "category": "ไฟฟ้า",
    "name": "มิเตอร์ไฟฟ้า 10 แอมป์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 89,
    "category": "ไฟฟ้า",
    "name": "กล่องเบรคเกอร์พร้อมเบรคเกอร์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 90,
    "category": "ไฟฟ้า",
    "name": "ขาหลอด 40 w.",
    "unit": "ขา",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 91,
    "category": "ไฟฟ้า",
    "name": "ตู้พลาสติค 10*12",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 92,
    "category": "ไฟฟ้า",
    "name": "ปลั๊กพ่วงสนาม",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": -1,
      "สโตร์รัตนา": 6,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 2,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 93,
    "category": "ไฟฟ้า",
    "name": "สปอร์ตไลท์ LED 400W",
    "unit": "หลอด",
    "quantities": {
      "สโตร์พงษ์เพชร": 1,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 4,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 94,
    "category": "ไฟฟ้า",
    "name": "สาย THW A*16 sqmm ยาว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 95,
    "category": "ไฟฟ้า",
    "name": "สาย THW A*20 sqmm ยาว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 96,
    "category": "ไฟฟ้า",
    "name": "สาย THW A*25 sqmm ยาว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 97,
    "category": "ไฟฟ้า",
    "name": "สาย THW A*30 sqmm ยาว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 98,
    "category": "ไฟฟ้า",
    "name": "สาย THW A*50 sqmm ยาว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 99,
    "category": "ไฟฟ้า",
    "name": "สาย THW A1*10 sqmm ยาว 100 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 100,
    "category": "ไฟฟ้า",
    "name": "ทะวายกลมล็อคสาย",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 13,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 101,
    "category": "ไฟฟ้า",
    "name": "แล็คไฟฟ้า 4 ช่อง",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 3,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 102,
    "category": "ไม้แบบ",
    "name": "แบบเสาเหล็ก 0.20 x 0.20 x 3.00 ม.",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 9,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 103,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.10 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 9,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 104,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.10 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 4,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 105,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.15 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 7,
      "โรงเรียนแนช": 6,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 106,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.15 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 3,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 107,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.20 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 5,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 108,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.20 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 20,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": -17,
      "โรงเรียนแนช": 22,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 109,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.20 x1.80 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 16,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 110,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.25 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 111,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.25 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 17,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 17,
      "โรงเรียนแนช": 38,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 112,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.25 x1.80 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 113,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.30 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 22,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 114,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.30 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 14,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 115,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.30 x1.80 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 116,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.35x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 117,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.40 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 7,
      "โรงเรียนแนช": 22,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 118,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.40 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 10,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 10,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 119,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.40 x1.80 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 15,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 120,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.50 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 121,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.50 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 122,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.60 x1.20 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 114,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 7,
      "เอกมัย": -4,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 40,
      "โกดังพี่เบิ้ล": 2,
      "โรงเรียนแนช": 47,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 123,
    "category": "ไม้แบบ",
    "name": "แบบเหล็ก 0.60 x1.50 ม.",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 124,
    "category": "ไม้แบบ",
    "name": "ไม้อัดดำ 1.20 x 2.40 ม. 15 mm",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 36,
      "เอกมัย": 10,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 169,
      "โกดังพี่เบิ้ล": 5,
      "โรงเรียนแนช": 411,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 125,
    "category": "ไม้แบบ",
    "name": "สปริงคริปงานเข้าแบบผนัง",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 423,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 126,
    "category": "ไม้แบบ",
    "name": "แบบเสาประกอบ 25*25*3.00",
    "unit": "ชิ้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 9,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 9,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 127,
    "category": "ไม้แบบ",
    "name": "แบบเสาประกอบ 30*40*3.00",
    "unit": "ชิ้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 2,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 2,
      "โรงเรียนแนช": 40,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 128,
    "category": "นั่งร้าน",
    "name": "เหล็กแป๊บกลม 1 1/2 นิ้ว 2.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 190,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 203,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 129,
    "category": "นั่งร้าน",
    "name": "เหล็กแป๊บกลม 1 1/2 นิ้ว 3.00 ม.",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -13,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 53,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 130,
    "category": "นั่งร้าน",
    "name": "เหล็กแป๊บกลม 1 1/2 นิ้ว 4.00 ม.",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 131,
    "category": "นั่งร้าน",
    "name": "เหล็กแป๊บกลม 1 1/2 นิ้ว 6.00 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 2,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 10,
      "โกดังพี่เบิ้ล": 6,
      "โรงเรียนแนช": 428,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 132,
    "category": "นั่งร้าน",
    "name": "ยูเฮด 20 เซน",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 102,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 133,
    "category": "นั่งร้าน",
    "name": "ยูเฮด",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -65,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 12,
      "โกดังพี่เบิ้ล": 78,
      "โรงเรียนแนช": 628,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 134,
    "category": "นั่งร้าน",
    "name": "แจ็คเบส",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -42,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 72,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 383,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 135,
    "category": "นั่งร้าน",
    "name": "ข้อเสือ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 240,
      "สโตร์รัตนา": 1251,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 68,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 80,
      "โกดังพี่เบิ้ล": 150,
      "โรงเรียนแนช": 1873,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 136,
    "category": "นั่งร้าน",
    "name": "ข้อต่อนั่งร้าน",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -140,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 140,
      "วอลโว่": 18,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 74,
      "โกดังพี่เบิ้ล": 116,
      "โรงเรียนแนช": 978,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 137,
    "category": "นั่งร้าน",
    "name": "แผ่นเหยียบ",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 2,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 6,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 138,
    "category": "นั่งร้าน",
    "name": "ตะเกียบสำหรับนั่งร้าน 0.5,0.9 ม",
    "unit": "คู่",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 139,
    "category": "นั่งร้าน",
    "name": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "unit": "คู่",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": -8,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 20,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 502,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 140,
    "category": "นั่งร้าน",
    "name": "นั่งร้านค้ำยันแบบขาคู่ 1.70",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 61,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 141,
    "category": "นั่งร้าน",
    "name": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "unit": "คู่",
    "quantities": {
      "สโตร์พงษ์เพชร": -3,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -12,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 81,
      "วอลโว่": -4,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 233,
      "โกดังพี่เบิ้ล": 68,
      "โรงเรียนแนช": 345,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 142,
    "category": "นั่งร้าน",
    "name": "นั่งร้าน 0.50 ซ.",
    "unit": "ขา",
    "quantities": {
      "สโตร์พงษ์เพชร": 38,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 143,
    "category": "นั่งร้าน",
    "name": "นั่งร้าน 1.20 ม.",
    "unit": "ขา",
    "quantities": {
      "สโตร์พงษ์เพชร": -161,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 7,
      "เอกมัย": 66,
      "วอลโว่": -5,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 60,
      "โกดังพี่เบิ้ล": -13,
      "โรงเรียนแนช": 385,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "ใช้งานได้ 364อีก 21 ตัวใง้งานไม่ได้ (ภูกตัดขา)"
  },
  {
    "row": 144,
    "category": "นั่งร้าน",
    "name": "นั่งร้าน 1.70 ม.",
    "unit": "ขา",
    "quantities": {
      "สโตร์พงษ์เพชร": -40,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -63,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 120,
      "วอลโว่": -6,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 225,
      "โกดังพี่เบิ้ล": 52,
      "โรงเรียนแนช": 289,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 145,
    "category": "นั่งร้าน",
    "name": "บันไดนั่งร้าน",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 3,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 4,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 5,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 146,
    "category": "นั่งร้าน",
    "name": "ป๊อปค้ำยัน**ตัวเมีย**2 ม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 38,
      "เอกมัย": -15,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 2,
      "โรงเรียนแนช": 107,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 147,
    "category": "นั่งร้าน",
    "name": "ป๊อปค้ำยัน**ตัวเมียขาคู่** 1.50 ม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 19,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 43,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 148,
    "category": "นั่งร้าน",
    "name": "ป๊อปค้ำยัน**ตัวผู้**2 ม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 47,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -35,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": -33,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 50,
      "โรงเรียนแนช": 249,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 149,
    "category": "นั่งร้าน",
    "name": "ป๊อปค้ำยัน**ตัวผู้**3 ม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 17,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 25,
      "เอกมัย": 19,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": -14,
      "โรงเรียนแนช": 17,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 150,
    "category": "นั่งร้าน",
    "name": "ฝาครอบนั่งร้าน",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 41,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 8,
      "เอกมัย": 8,
      "วอลโว่": 0,
      "งานซ่อม": -25,
      "กบินทร์บุรี": 18,
      "โกดังพี่เบิ้ล": 18,
      "โรงเรียนแนช": 27,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 151,
    "category": "นั่งร้าน",
    "name": "ล้อนั่งร้านแบบโพลี่ 6 นิ้ว",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 4,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 4,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 152,
    "category": "นั่งร้าน",
    "name": "ล้อนั่งร้านแบบโพลี่ 8 นิ้ว",
    "unit": "ล้อ",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -12,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 8,
      "โกดังพี่เบิ้ล": 8,
      "โรงเรียนแนช": 12,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 153,
    "category": "นั่งร้าน",
    "name": "ล้อนั่งร้านแบบธรรมดา 6 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 12,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 154,
    "category": "นั่งร้าน",
    "name": "ล้อนั่งร้านแบบธรรมดา 8 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 4,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 4,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 155,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เศษตะแกรงไวเมท",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 156,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก DB 12  *2 ม**เศษ",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 157,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก DB 12  *3-4 ม**เศษ",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 158,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก DB 16  *4 ม**เศษ",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 159,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก DB 20  *4 ม**เศษ",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 160,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "แฟลชชิ่ง 3 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 161,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ตะแกรงกรงไก่",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 162,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ท่อ PVC 4 หุน 6 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 163,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ท่อ PVC 4 หุน ยาว 2-3 ม",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 164,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เศษไม้อัด 2*2",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 165,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ท่อไฟ 3 นิ้ว",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 166,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก L-bolt",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 167,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "อิฐมวลเบา 20*60",
    "unit": "ก้อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 7,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 168,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "สามทาง pvc 4 นิ้ว",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 169,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เหล็ก H B  20 ซ",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 170,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "คลอบโค้ง 3 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 171,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "แผ่นใส 1.5 ม",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 172,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "คลอบประตู",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 173,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ท่อ pvc 6 นิ้ว",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 174,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ซีรางน้ำ",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 175,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ต่อตรง pvc 3 นิ้ว",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 176,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ข้องอ Pvc 90 4 นิ้ว",
    "unit": "ท่อน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 177,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "แผ่นสังกะสี",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 178,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "เซี๊ยม pvc  7 มม ยาว 2 ม.",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 200,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 179,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ลวดผูกเหล็ก",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 180,
    "category": "วัสดุก่อสร้างที่เหลือ",
    "name": "ยางบวมน้ำ",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 181,
    "category": "อุปกรณ์ตรวจสอบ",
    "name": "เครื่องเทสคอนกรีต",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 182,
    "category": "อุปกรณ์สำนักงาน",
    "name": "เก้าอี้ขาว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 183,
    "category": "อุปกรณ์สำนักงาน",
    "name": "กล้องวงจรปิด",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "อยู่บ้านวิภา 3 ตัว"
  },
  {
    "row": 184,
    "category": "อุปกรณ์สำนักงาน",
    "name": "เก้าอี้ดำพับ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 185,
    "category": "อุปกรณ์สำนักงาน",
    "name": "เครื่องปริ้น",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 186,
    "category": "อุปกรณ์สำนักงาน",
    "name": "โต๊ะพับ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 187,
    "category": "อุปกรณ์สำนักงาน",
    "name": "ทีวีพร้อมขาตั้งทีวี",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 188,
    "category": "อุปกรณ์สำนักงาน",
    "name": "กระดานไวท์บอร์ด",
    "unit": "แผ่น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 189,
    "category": "อื่นๆ",
    "name": "แผ่นเหล็กพับลูกบันได 0.30x0.60 ม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 190,
    "category": "อื่นๆ",
    "name": "สายยางสีเขียว 50 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 191,
    "category": "อื่นๆ",
    "name": "กะบะผสมปูน",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 192,
    "category": "อื่นๆ",
    "name": "ไมโครเวฟ",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 193,
    "category": "อื่นๆ",
    "name": "ตู้เย็น",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 194,
    "category": "อื่นๆ",
    "name": "ร่มเซอร์เวย์",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 195,
    "category": "อื่นๆ",
    "name": "โถนั่งยอง",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 196,
    "category": "อื่นๆ",
    "name": "ชักโครก",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 2,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 197,
    "category": "อื่นๆ",
    "name": "ผ้าใบคลุมปูน 4*6 เมตร",
    "unit": "ผืน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 3,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 3,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 199,
    "category": "อื่นๆ",
    "name": "จิ๊กป้ายโชว์รูม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 200,
    "category": "อื่นๆ",
    "name": "พุกเหล็ก3/8",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 201,
    "category": "อื่นๆ",
    "name": "พุกเหล็ก5/8",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 202,
    "category": "อื่นๆ",
    "name": "กรวยกั้นพื้นที่",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 203,
    "category": "อื่นๆ",
    "name": "เหล็กวายเมท",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 204,
    "category": "อื่นๆ",
    "name": "กระดาษกาวบิวทิล",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 205,
    "category": "อื่นๆ",
    "name": "ตะปูตอกไม้ 2 นิ้ว",
    "unit": "ลัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 206,
    "category": "อื่นๆ",
    "name": "รูฟซิล",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 2,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 207,
    "category": "อื่นๆ",
    "name": "ท่อผ้าใบ 3 นิ้ว 20 ม.",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 208,
    "category": "อื่นๆ",
    "name": "สายยางปั้มออโต้",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 209,
    "category": "อื่นๆ",
    "name": "ท่อดูดอากาศ",
    "unit": "ม้วน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 210,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องแสกนความร้อน",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 211,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องเป่าลมร้อน",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 212,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ปั๊กเก็ตเทปูนแบบเปิดข้าง",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 213,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องขัดหน้าปูนฉาบ",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 214,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องปาดหน้าปูนไร้สาย",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 215,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องตบดิน",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 1,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 1,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 216,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องโม่ปูนฉาบ",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 1,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 1,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 217,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องฉีดน้ำแรงดันสูง",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 218,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "สว่านไร้สาย",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 219,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ลูกหมูไร้สาย",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 220,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องดัดเหล็ก",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 221,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องตัดเหล็ก",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 222,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องดูดฝุ่น",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "เครื่องเล็กรอซ่อม"
  },
  {
    "row": 223,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องปันไฟ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 224,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องตัดจ๊อย Honda",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 225,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ใบตัดไฟเบอร์",
    "unit": "ใบ",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 226,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เลื่อยยนตร์ (เลื่อยตัดไม้)",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 227,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เลื่อยจิ๊กซอร์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 228,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เลื่อยวงเดือน 7 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 229,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "สายลมแก๊ส 25 เมตร",
    "unit": "เส้น",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 230,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ชุดตัดแก๊ส",
    "unit": "ชุด",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 231,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "แย็กไฟฟ้า 10 kg",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 232,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "แย็กไฟฟ้า 5 kg",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": "ที่ออฟฟิศใช้ได้ 1 ตัว 5 ตัวรอซ่อม"
  },
  {
    "row": 233,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "โบเวอร์เป่าลม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 234,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องขัดกระดาษทราย",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 235,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องฉีดน้ำ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 236,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ไดโว่สูบน้ำ 1 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 237,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ไดโว่สูบน้ำ 2 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 238,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ไดโว่สูบน้ำ 3 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 239,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ไฟเบอร์ตัดปูน 4 นิ้ว",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 240,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ไฟเบอร์ 14 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 1,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 241,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ตู้เชื่อม",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 1,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 242,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ปั้มน้ำธรรมดา 1 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 243,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ปั๊มน้ำออโต้",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 244,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "พัดลมดูดอากาศพร้อมสาย",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 245,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "พัดลม 18 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 246,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องวัดความหนาสี",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 247,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "พัดลมอุตาสาหกรรม 24 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 2,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 248,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ลิฟท์กระป๋อง",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 249,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "แฮนด์ลิฟท์",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 250,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ลูกหมู 7 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 3,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 251,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "ลูกหมู 4 นิ้ว",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 2,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 2,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 252,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "สายวายจี้ 1 นิ้ว ยาว 6 ม.",
    "unit": "สาย",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 253,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "วายจี้ปูนไฟฟ้า 1 นิ้ว ยาว 2 ม.",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 1,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 254,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "วายจี้ปูน 1.5 นิ้ว ยาว 6 ม.",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 1,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 255,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "เครื่องจี้ปูน 5.5 แรงม้า",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 2,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 256,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "สว่านไฟฟ้า ธรรมดา",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 2,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 2,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 257,
    "category": "อุปกรณ์ไฟฟ้า",
    "name": "สว่านไฟฟ้า 3 ระบบ",
    "unit": "ตัว",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": -1,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 1,
      "วอลโว่": 0,
      "งานซ่อม": 1,
      "กบินทร์บุรี": 1,
      "โกดังพี่เบิ้ล": 1,
      "โรงเรียนแนช": 1,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 1,
      "สูญหาย": 0
    },
    "note": "สถานะ รอส่งร้าน"
  },
  {
    "row": 258,
    "category": "ยานพาหนะ",
    "name": "รถมอเตอร์ไซด์ จจพ เชียงใหม่ 982",
    "unit": "คัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 259,
    "category": "ยานพาหนะ",
    "name": "รถกระบะ ถธ3123 กทม",
    "unit": "คัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 260,
    "category": "ของที่ใช้งานไม่ได้",
    "name": "ซากแอร์ คอยเย็น",
    "unit": "เครื่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 261,
    "category": "ยานพาหนะ",
    "name": "เหล็กคอกรถกระบะ",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 262,
    "category": "ยานพาหนะ",
    "name": "หลังคารถกระบะแบบสวมคอก",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 263,
    "category": "สี",
    "name": "สีกันสนิม 3 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": -3,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 3,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 264,
    "category": "สี",
    "name": "สีกันสนิม 18",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 265,
    "category": "สี",
    "name": "สีทาเหล็ก โชกูกุ 18 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 266,
    "category": "สี",
    "name": "สีทาเหล็ก โชกูกุ 3 ลิตร",
    "unit": "ถัง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 267,
    "category": "สี",
    "name": "ปืนยิง pu",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 268,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ค้อน",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 269,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ขวาน",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 270,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ค้อนปอนด์",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 271,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "บันไดเอเฟรมอลูมิเนียม",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 272,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "หกเหลี่ยม เบอร์ 19",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 273,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ใบตัดปูน 7 นิ้ว",
    "unit": "อัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 274,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ปูนปรับระดับ",
    "unit": "ถุง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 275,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ปูนเกล๊า",
    "unit": "ถุง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 276,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ตู้กันฝน",
    "unit": "ใบ",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 277,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "รถเข็นปูนแบบล้อเดียว",
    "unit": "คัน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 278,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ตะปูคอนกรีต",
    "unit": "กล่อง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 279,
    "category": "อุปกรณ์ก่อสร้าง",
    "name": "ประตู",
    "unit": "บาน",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 280,
    "category": "เครื่องมือก่อสร้าง",
    "name": "ตู้ไฟ 3 เฟส",
    "unit": "ใบ",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 2,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 0,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  },
  {
    "row": 281,
    "category": "วัสดุสิ้นเปลือง",
    "name": "ปูนสกิมตราลูกดิ่ง  (ขาว)",
    "unit": "ถุง",
    "quantities": {
      "สโตร์พงษ์เพชร": 0,
      "สโตร์ออฟฟิศ": 0,
      "สโตร์รัตนา": 0,
      "สโตร์ไทรน้อย": 0,
      "เอกมัย": 0,
      "วอลโว่": 0,
      "งานซ่อม": 0,
      "กบินทร์บุรี": 0,
      "โกดังพี่เบิ้ล": 0,
      "โรงเรียนแนช": 80,
      "โตโยต้า นครพิงค์": 0,
      "เช่า": 0,
      "ร้านซ่อม": 0,
      "สูญหาย": 0
    },
    "note": ""
  }
],
    pending: [],
    history: [
  {
    "date": "2026-07-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เครื่องจี้ปูน 5.5 แรงม้า",
    "quantity": 1,
    "fromLocation": "ร้านซ่อม",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 2
  },
  {
    "date": "2026-07-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เครื่องดัดเหล็ก",
    "quantity": 1,
    "fromLocation": "ร้านซ่อม",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-07-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เครื่องตัดจ๊อย Honda",
    "quantity": 1,
    "fromLocation": "งานซ่อม",
    "toLocation": "กบินทร์บุรี",
    "carrier": "ใบตอง",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-07-09T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ไม้อัดดำ 1.20 x 2.40 ม. 15 mm",
    "quantity": 10,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "เอกมัย",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 411,
    "balanceTo": 10
  },
  {
    "date": "2026-07-09T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 106,
    "fromLocation": "ร้านค้า",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "บจก. เอลแกน บิลด์",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ฝาครอบนั่งร้าน",
    "quantity": 3,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 8,
    "balanceTo": 18
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 24,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 140,
    "balanceTo": 116
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 12,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 81,
    "balanceTo": 68
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 12,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 120,
    "balanceTo": 52
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า ธรรมดา",
    "quantity": 1,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 2,
    "balanceTo": 1
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ปลั๊กพ่วงสนาม",
    "quantity": 2,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "เอกมัย",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ประจำชุดช่างตา",
    "balanceFrom": -1,
    "balanceTo": 2
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า 3 ระบบ",
    "quantity": 1,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "เอกมัย",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ประจำชุดช่างตา",
    "balanceFrom": -1,
    "balanceTo": 1
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า ธรรมดา",
    "quantity": 1,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "เอกมัย",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ประจำชุดช่างตา",
    "balanceFrom": 2,
    "balanceTo": 1
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ลูกหมู 4 นิ้ว",
    "quantity": 1,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "เอกมัย",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ประจำชุดช่างตา",
    "balanceFrom": 2,
    "balanceTo": 0
  },
  {
    "date": "2026-07-08T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เลเซอร์",
    "quantity": 1,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "เอกมัย",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ประจำชุดช่างตา",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-07-07T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "เลเซอร์",
    "quantity": 1,
    "fromLocation": "ร้านค้า",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-07-07T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ลูกหมู 4 นิ้ว",
    "quantity": 1,
    "fromLocation": "งานซ่อม",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "คุณปุยเอ็นแมท ขอยืมไปแล้วนำกลับมาคืน",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-07-07T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ฝาครอบนั่งร้าน",
    "quantity": 25,
    "fromLocation": "งานซ่อม",
    "toLocation": "โรงเรียนแนช",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -25,
    "balanceTo": 27
  },
  {
    "date": "2026-07-06T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ล้อนั่งร้านแบบโพลี่ 8 นิ้ว",
    "quantity": 8,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -12,
    "balanceTo": 8
  },
  {
    "date": "2026-07-06T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า 3 ระบบ",
    "quantity": 1,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1,
    "balanceTo": 0
  },
  {
    "date": "2026-07-06T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า ธรรมดา",
    "quantity": 1,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 3,
    "balanceTo": 3
  },
  {
    "date": "2026-07-06T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ลูกหมู 4 นิ้ว",
    "quantity": 1,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 3
  },
  {
    "date": "2026-07-02T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 240,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "สโตร์ออฟฟิศ",
    "carrier": "ช่างดำ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1873,
    "balanceTo": 240
  },
  {
    "date": "2026-07-01T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ยูเฮด",
    "quantity": 25,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 628
  },
  {
    "date": "2026-07-01T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 360,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1251,
    "balanceTo": 2113
  },
  {
    "date": "2026-07-01T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แจ็คเบส",
    "quantity": 30,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -42,
    "balanceTo": 383
  },
  {
    "date": "2026-06-30T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ลิฟท์กระป๋อง",
    "quantity": 1,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ชุด ผรม.ช่างภูบาล  ใช้งานขึ้นวัสดุ",
    "balanceFrom": 1,
    "balanceTo": 1
  },
  {
    "date": "2026-06-30T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเหล็ก 0.60 x1.20 ม.",
    "quantity": 45,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "1ฒล-5913 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "รร.แนชเลิกใช้ นำกลับมาสต็อกรอขึ้นงานใหม่",
    "balanceFrom": 47,
    "balanceTo": 114
  },
  {
    "date": "2026-06-30T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สว่านไฟฟ้า 3 ระบบ",
    "quantity": 1,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "งานซ่อม",
    "carrier": "1ฒล-5913 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ชุดช่างดำ ใช้งาน สำหรับงานซ่อมแต่ละโครงการ",
    "balanceFrom": -1,
    "balanceTo": 1
  },
  {
    "date": "2026-06-30T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ลูกหมู 4 นิ้ว",
    "quantity": 1,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "งานซ่อม",
    "carrier": "1ฒล-5913 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ชุดช่างดำ ใช้งาน สำหรับงานซ่อมแต่ละโครงการ",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-06-30T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตู้เชื่อม",
    "quantity": 1,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "งานซ่อม",
    "carrier": "1ฒล-5913 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ชุดช่างดำ ใช้งาน สำหรับงานซ่อมแต่ละโครงการ",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 240,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 80,
    "balanceTo": 1753
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ยูเฮด",
    "quantity": 100,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 12,
    "balanceTo": 603
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แจ็คเบส",
    "quantity": 40,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 72,
    "balanceTo": 353
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 50,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ชำรุด",
    "balanceFrom": 20,
    "balanceTo": 502
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 86,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 70,
    "balanceTo": 452
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ไม้อัดดำ 1.20 x 2.40 ม. 15 mm",
    "quantity": 41,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 169,
    "balanceTo": 421
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 84,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 60,
    "balanceTo": 385
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กแป๊บกลม 1 1/2 นิ้ว 6.00 ม.",
    "quantity": 30,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 10,
    "balanceTo": 428
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" 6.00 เมตร",
    "quantity": 30,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 107,
    "balanceTo": 432
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" 6.00 เมตร",
    "quantity": 30,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 11,
    "balanceTo": 138
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 4,
    "fromLocation": "วอลโว่",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -4,
    "balanceTo": 345
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 8,
    "fromLocation": "วอลโว่",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -8,
    "balanceTo": 366
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 6,
    "fromLocation": "วอลโว่",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -6,
    "balanceTo": 289
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 5,
    "fromLocation": "วอลโว่",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -5,
    "balanceTo": 301
  },
  {
    "date": "2026-06-29T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 450,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1611,
    "balanceTo": 1513
  },
  {
    "date": "2026-06-27T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "สีกันสนิม 3 ลิตร",
    "quantity": 3,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -3,
    "balanceTo": 3
  },
  {
    "date": "2026-06-27T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 450,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 2061,
    "balanceTo": 1063
  },
  {
    "date": "2026-06-26T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 120,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 233,
    "balanceTo": 341
  },
  {
    "date": "2026-06-25T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เครื่องตบดิน",
    "quantity": 1,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "งานซ่อม",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "อยู่ร้านซ่อม รอเสนอราคา  เบอร์ร้าน 086-8948122",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-06-25T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เครื่องตัดจ๊อย Honda",
    "quantity": 1,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "งานซ่อม",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "อยู่ร้านซ่อม รอเสนอราคา  เบอร์ร้าน 086-8948122",
    "balanceFrom": 0,
    "balanceTo": 1
  },
  {
    "date": "2026-06-25T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 10,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -12,
    "balanceTo": 221
  },
  {
    "date": "2026-06-25T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เข็มขัดเซฟตี้",
    "quantity": 2,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1,
    "balanceTo": 2
  },
  {
    "date": "2026-06-25T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 300,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 2511,
    "balanceTo": 613
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 23,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -3,
    "balanceTo": 211
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**3 ม",
    "quantity": 17,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 17,
    "balanceTo": 17
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**2 ม",
    "quantity": 40,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 47,
    "balanceTo": 249
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ฝาครอบนั่งร้าน",
    "quantity": 20,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 41,
    "balanceTo": 2
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 40,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -40,
    "balanceTo": 283
  },
  {
    "date": "2026-06-20T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 178,
    "fromLocation": "สโตร์พงษ์เพชร",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -161,
    "balanceTo": 296
  },
  {
    "date": "2026-06-19T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ฝาครอบนั่งร้าน",
    "quantity": 6,
    "fromLocation": "โรงเรียนแนช",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -18,
    "balanceTo": 15
  },
  {
    "date": "2026-06-17T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "เหล็กแป๊บกลม 1 1/2 นิ้ว 6.00 ม.",
    "quantity": 190,
    "fromLocation": "ร้านค้า",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-17T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "เหล็กกล่อง 4\"x4\" 6.00 เมตร",
    "quantity": 60,
    "fromLocation": "ร้านค้า",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-17T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "เหล็กกล่อง 2\"x2\" 6.00 เมตร",
    "quantity": 185,
    "fromLocation": "ร้านค้า",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-17T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "ไม้อัดดำ 1.20 x 2.40 ม. 15 mm",
    "quantity": 270,
    "fromLocation": "ร้านค้า",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-16T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ล้อนั่งร้านแบบโพลี่ 8 นิ้ว",
    "quantity": 12,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -4,
    "balanceTo": 12
  },
  {
    "date": "2026-06-16T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 350,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -140,
    "balanceTo": 978
  },
  {
    "date": "2026-06-16T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แมสชีส 1.80x5.10 ม.",
    "quantity": 80,
    "fromLocation": "เอกมัย",
    "toLocation": "สโตร์รัตนา",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -18,
    "balanceTo": 175
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กแป๊บกลม 1 1/2 นิ้ว 3.00 ม.",
    "quantity": 13,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -13,
    "balanceTo": 53
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้านค้ำยันแบบขาคู่ 1.70",
    "quantity": 18,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 1,
    "balanceTo": 61
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 36,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 164,
    "balanceTo": 628
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 81,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 93,
    "balanceTo": 188
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 7,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 66,
    "balanceTo": 118
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 53,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 132,
    "balanceTo": 243
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แผ่นเหล็กปูทาง 1.2*2.4",
    "quantity": 5,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 5
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**2 ม",
    "quantity": 33,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -33,
    "balanceTo": 209
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวเมีย**2 ม",
    "quantity": 49,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -15,
    "balanceTo": 107
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กแป๊บกลม 1 1/2 นิ้ว 6.00 ม.",
    "quantity": 99,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 398
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กแป๊บกลม 1.5 น.ยาว 2.50-3 ม.",
    "quantity": 11,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -11,
    "balanceTo": 11
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" เศษ 2.00 ม.",
    "quantity": 17,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -5,
    "balanceTo": 24
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษไม่เกิน 1.00 ม.",
    "quantity": 54,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -54,
    "balanceTo": 186
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 2.00 ม.",
    "quantity": 21,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 11,
    "balanceTo": 106
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 3.00 ม.",
    "quantity": 3,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 30,
    "balanceTo": 3
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 1.00 ม.",
    "quantity": 103,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -35,
    "balanceTo": 358
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 2.50 ม.",
    "quantity": 12,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -12,
    "balanceTo": 0
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" 6.00 เมตร",
    "quantity": 28,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 12,
    "balanceTo": 402
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แผ่นเหยียบ",
    "quantity": 1,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 2,
    "balanceTo": 2
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แจ็คเบส",
    "quantity": 12,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -12,
    "balanceTo": 313
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ยูเฮด",
    "quantity": 65,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -65,
    "balanceTo": 503
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แมสชีส 1.80x5.10 ม.",
    "quantity": 8,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 62,
    "balanceTo": 8
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "บันไดนั่งร้าน",
    "quantity": 2,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 5
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเหล็ก 0.60 x1.20 ม.",
    "quantity": 18,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -4,
    "balanceTo": 92
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 60,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 200,
    "balanceTo": 592
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 263,
    "fromLocation": "เอกมัย",
    "toLocation": "โรงเรียนแนช",
    "carrier": "สมพงษ์",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 68,
    "balanceTo": 313
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "แจ็คเบส",
    "quantity": 150,
    "fromLocation": "",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ซื้อจากร้านค้า",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-15T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 180,
    "fromLocation": "",
    "toLocation": "โรงเรียนแนช",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "ซื้อจากร้านค้า",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ปูนสกิมตราลูกดิ่ง  (ขาว)",
    "quantity": 80,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 80
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เซี๊ยม pvc  7 มม ยาว 2 ม.",
    "quantity": 200,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 0,
    "balanceTo": 200
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**2 ม",
    "quantity": 35,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -35,
    "balanceTo": 176
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 2,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -2,
    "balanceTo": 107
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 31,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -63,
    "balanceTo": 190
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กฉาก 2*2 ยาว 6 ม.",
    "quantity": 6,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -6,
    "balanceTo": 6
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อเสือ",
    "quantity": 50,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 320,
    "balanceTo": 50
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 132,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 74,
    "balanceTo": 532
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" เศษ 2.00 ม.",
    "quantity": 7,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -7,
    "balanceTo": 7
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ยูเฮด",
    "quantity": 169,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 112,
    "balanceTo": 438
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แจ็คเบส",
    "quantity": 28,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 112,
    "balanceTo": 301
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.20 ม",
    "quantity": 80,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 156,
    "balanceTo": 358
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 40,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 144,
    "balanceTo": 111
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กแป๊บกลม 1 1/2 นิ้ว 6.00 ม.",
    "quantity": 38,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 40,
    "balanceTo": 299
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" 6.00 เมตร",
    "quantity": 49,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 137,
    "balanceTo": 374
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" เศษ 3.00 ม.",
    "quantity": 18,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": -4,
    "balanceTo": 36
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\"เศษ 4 ม.",
    "quantity": 14,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 31,
    "balanceTo": 14
  },
  {
    "date": "2026-06-13T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" 6.00 เมตร",
    "quantity": 14,
    "fromLocation": "กบินทร์บุรี",
    "toLocation": "โรงเรียนแนช",
    "carrier": "65-5757 กทม.",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 41,
    "balanceTo": 108
  },
  {
    "date": "2026-06-12T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ข้อต่อนั่งร้าน",
    "quantity": 40,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "ช่างวิน",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 260,
    "balanceTo": 92
  },
  {
    "date": "2026-06-12T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 20,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "ช่างวิน",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 174,
    "balanceTo": 56
  },
  {
    "date": "2026-06-12T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้านค้ำยันแบบขาคู่ 1.70",
    "quantity": 20,
    "fromLocation": "เอกมัย",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "ช่างวิน",
    "reporter": "พี่โย",
    "remark": "",
    "balanceFrom": 19,
    "balanceTo": 0
  },
  {
    "date": "2026-06-12T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ล้อนั่งร้านแบบธรรมดา 8 นิ้ว",
    "quantity": 4,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "ช่างวิน",
    "reporter": "พี่โย",
    "remark": "งานโครงหหลังคา/ช่างยะ",
    "balanceFrom": 4,
    "balanceTo": 4
  },
  {
    "date": "2026-06-12T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ล้อนั่งร้านแบบโพลี่ 6 นิ้ว",
    "quantity": 4,
    "fromLocation": "สโตร์ออฟฟิศ",
    "toLocation": "โกดังพี่เบิ้ล",
    "carrier": "พี่หลับ",
    "receiver": "ช่างวิน",
    "reporter": "พี่โย",
    "remark": "งานโครงหหลังคา/ช่างยะ",
    "balanceFrom": 4,
    "balanceTo": 4
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเสาประกอบ 30*40*3.00",
    "quantity": 2,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 2,
    "balanceTo": 2
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเสาประกอบ 25*25*3.00",
    "quantity": 9,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 9,
    "balanceTo": 9
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 4\"x4\" เศษ 3.00 ม.",
    "quantity": 9,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 0,
    "balanceTo": 18
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ตะเกียบสำหรับนั่งร้าน 1.70 ม",
    "quantity": 20,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 36,
    "balanceTo": 20
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.20 ม.",
    "quantity": 17,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": -13,
    "balanceTo": 17
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเหล็ก 0.25 x1.50 ม.",
    "quantity": 10,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 17,
    "balanceTo": 0
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเหล็ก 0.20 x1.50 ม.",
    "quantity": 20,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": -17,
    "balanceTo": 20
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "แบบเหล็ก 0.60 x1.20 ม.",
    "quantity": 60,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 2,
    "balanceTo": 69
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 2.50 ม.",
    "quantity": 12,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 78,
    "balanceTo": 12
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "เหล็กกล่อง 2\"x2\" เศษ 1.00 ม.",
    "quantity": 160,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 228,
    "balanceTo": 160
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**3 ม",
    "quantity": 17,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": -14,
    "balanceTo": 34
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ป๊อปค้ำยัน**ตัวผู้**2 ม",
    "quantity": 45,
    "fromLocation": "โกดังพี่เบิ้ล",
    "toLocation": "สโตร์พงษ์เพชร",
    "carrier": "ช่างดี",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "เลิกใช้งาน",
    "balanceFrom": 50,
    "balanceTo": 87
  },
  {
    "date": "2026-06-11T00:00:00.000Z",
    "type": "อื่นๆ",
    "itemName": "ตู้ไฟ 3 เฟส",
    "quantity": 1,
    "fromLocation": "",
    "toLocation": "สโตร์รัตนา",
    "carrier": "",
    "receiver": "สมพงษ์",
    "reporter": "พี่โย",
    "remark": "รับจากเอ็นโค่",
    "balanceFrom": null,
    "balanceTo": null
  },
  {
    "date": "2026-06-10T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "ยูเฮด",
    "quantity": 50,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "มานพ",
    "reporter": "พี่โย",
    "remark": "รับพื้นชั้น 2",
    "balanceFrom": 25,
    "balanceTo": 269
  },
  {
    "date": "2026-06-10T00:00:00.000Z",
    "type": "ขนย้าย",
    "itemName": "นั่งร้าน 1.70 ม.",
    "quantity": 32,
    "fromLocation": "สโตร์รัตนา",
    "toLocation": "โรงเรียนแนช",
    "carrier": "ช่างดี",
    "receiver": "มานพ",
    "reporter": "พี่โย",
    "remark": "รับพื้นชั้น 2",
    "balanceFrom": -32,
    "balanceTo": 159
  }
]
  };
}

function loadLocalData() {
  try {
    const raw = localStorage.getItem(MOCK_STORAGE_KEY);
    if (raw) {
      const parsed = JSON.parse(raw);
      if (parsed && Array.isArray(parsed.items) && parsed.items.length >= 200) {
        if (!Array.isArray(parsed.history)) parsed.history = [];
        if (!Array.isArray(parsed.locations)) parsed.locations = [];
        return parsed;
      }
    }
  } catch (e) {}
  const init = getInitialLocalData();
  saveLocalData(init);
  return init;
}

function saveLocalData(data) {
  try {
    localStorage.setItem(MOCK_STORAGE_KEY, JSON.stringify(data));
  } catch (e) {}
}

// ====== API ======
async function apiGet(pathStr) {
  try {
    const res = await fetch(pathStr, { headers: { 'Accept': 'application/json' } });
    if (res.ok) {
      const ct = res.headers.get('content-type') || '';
      if (ct.includes('application/json')) {
        const data = await res.json();
        if (data && data.success === true) {
          if (pathStr.startsWith('/api/inventory') && (!Array.isArray(data.items) || data.items.length === 0)) {
            throw new Error('empty');
          }
          return data;
        }
      }
    }
  } catch (err) {}

  const local = loadLocalData();
  if (pathStr.startsWith('/api/inventory')) {
    const activeLocs = (local.locations || []).filter(function(l) { return !l.archived; });
    return { success: true, locations: activeLocs, allLocations: local.locations || [], items: local.items || [] };
  }
  if (pathStr.startsWith('/api/locations')) {
    return { success: true, locations: local.locations || [] };
  }
  if (pathStr.startsWith('/api/categories')) {
    const cats = [...new Set((local.items || []).map(function(i) { return i.category; }).filter(Boolean))];
    return { success: true, categories: cats };
  }
  if (pathStr.startsWith('/api/settings')) {
    return { success: true, settings: { appTitle: 'Store Manager V1' } };
  }
  if (pathStr.startsWith('/api/history')) {
    const hist = local.history || [];
    const page = parseInt(pathStr.split('page=')[1]) || 1;
    const limit = parseInt(pathStr.split('limit=')[1]) || 30;
    return { success: true, total: hist.length, history: hist.slice((page-1)*limit, page*limit) };
  }
  return { success: true };
}

async function apiPost(pathStr, body) {
  try {
    const res = await fetch(pathStr, {
      method: 'POST',
      headers: { 'Content-Type': 'application/json', 'Accept': 'application/json' },
      body: JSON.stringify(body),
    });
    if (res.ok) {
      const ct = res.headers.get('content-type') || '';
      if (ct.includes('application/json')) {
        const data = await res.json();
        if (data && data.success === true) return data;
      }
    }
  } catch (err) {}

  const local = loadLocalData();

  if (pathStr === '/api/inventory/move') {
    const item = local.items.find(function(i) { return i.name === body.itemName; });
    if (!item) throw new Error('ไม่พบรายการ ' + body.itemName);
    const qty = Number(body.quantity);
    const cf = item.quantities[body.fromLocation] || 0;
    if (cf < qty) throw new Error('ยอดต้นทางไม่พอ (มี ' + cf + ')');
    item.quantities[body.fromLocation] = cf - qty;
    item.quantities[body.toLocation] = (item.quantities[body.toLocation] || 0) + qty;
    local.history.unshift({ date: new Date().toISOString(), type: 'ขนย้าย', itemName: body.itemName, quantity: qty, fromLocation: body.fromLocation, toLocation: body.toLocation, carrier: body.carrier||'', receiver: body.receiver||'', reporter: body.reporter||body.carrier||'', remark: body.remark||'', balanceFrom: item.quantities[body.fromLocation], balanceTo: item.quantities[body.toLocation] });
    saveLocalData(local);
    return { success: true, message: 'ขนย้าย ' + body.itemName + ' จำนวน ' + qty + ' เรียบร้อย' };
  }

  if (pathStr === '/api/inventory/adjust') {
    const item = local.items.find(function(i) { return i.name === body.itemName; });
    if (!item) throw new Error('ไม่พบรายการ ' + body.itemName);
    const prev = item.quantities[body.location] || 0;
    const newQ = Number(body.newQuantity);
    item.quantities[body.location] = newQ;
    local.history.unshift({ date: new Date().toISOString(), type: 'ปรับยอด', itemName: body.itemName, quantity: Math.abs(newQ - prev), fromLocation: body.location, reporter: body.adjusterName, remark: body.remark||'', balanceFrom: prev, balanceTo: newQ });
    saveLocalData(local);
    return { success: true, message: 'ปรับยอด ' + body.itemName + ' เป็น ' + newQ + ' เรียบร้อย' };
  }

  if (pathStr === '/api/inventory/add-item') {
    if (local.items.some(function(i) { return i.name === body.name; })) throw new Error('มีรายการนี้อยู่แล้ว');
    const ni = { row: local.items.length + 3, category: body.category||'ทั่วไป', name: body.name, unit: body.unit||'ชิ้น', quantities: {}, note: body.note||'' };
    local.locations.forEach(function(l) { ni.quantities[l.name] = 0; });
    local.items.push(ni);
    saveLocalData(local);
    return { success: true, message: 'เพิ่มรายการ ' + body.name + ' เรียบร้อย' };
  }

  if (pathStr === '/api/locations/add') {
    if (local.locations.some(function(l) { return l.name === body.name; })) throw new Error('มีสถานที่นี้อยู่แล้ว');
    local.locations.push({ name: body.name, type: body.type||'ไซต์งาน', col: local.locations.length + 4, archived: false, hideCount: false });
    saveLocalData(local);
    return { success: true, message: 'เพิ่มสถานที่ ' + body.name + ' เรียบร้อย' };
  }

  if (pathStr === '/api/locations/archive') {
    const loc = local.locations.find(function(l) { return l.name === body.name; });
    if (loc) loc.archived = body.archived;
    saveLocalData(local);
    return { success: true, message: 'บันทึกสถานะเรียบร้อย' };
  }

  if (pathStr === '/api/settings') {
    return { success: true, message: 'บันทึกเรียบร้อย' };
  }

  if (pathStr === '/api/categories/rename') {
    local.items.forEach(function(i) { if (i.category === body.oldName) i.category = body.newName; });
    saveLocalData(local);
    return { success: true, message: 'เปลี่ยนชื่อหมวดหมู่เรียบร้อย' };
  }

  if (pathStr === '/api/history/undo') {
    if (!local.history.length) throw new Error('ไม่มีรายการให้ยกเลิก');
    const last = local.history.shift();
    
    // Restore inventory balance
    const item = local.items.find(function(i) { return i.name === last.itemName; });
    if (item) {
      if (last.type === 'ขนย้าย') {
        const qty = Number(last.quantity) || 0;
        if (last.fromLocation) item.quantities[last.fromLocation] = Number(item.quantities[last.fromLocation] || 0) + qty;
        if (last.toLocation) item.quantities[last.toLocation] = Math.max(0, Number(item.quantities[last.toLocation] || 0) - qty);
      } else if (last.type === 'ปรับยอด' && last.balanceFrom !== undefined) {
        if (last.fromLocation) item.quantities[last.fromLocation] = Number(last.balanceFrom);
      }
    }
    
    saveLocalData(local);
    return { success: true, message: 'ยกเลิกรายการ "' + last.itemName + '" แล้ว (คืนยอดเดิม)' };
  }

  return { success: true };
}


/**
 * JavaScript.html — Frontend Logic (v4)
 * Fixes: history, location mgmt, mobile inventory layout
 * New: settings (company name), category reordering, category management, dropdown
 */

// ====== STATE ======
const state = {
  settings: { companyName: '', appTitle: 'Store Manager V1' },
  locations: [],
  allLocations: [],
  items: [],
  history: [],
  historyTotal: 0,
  historyPage: 1,
  currentPage: 'move',
  locFilter: 'all',
  invLocFilter: 'all',
  searchTerm: '',
  sourceLocation: null,
  destLocation: null,
  draggedCard: null,
  adjustItem: null,
  adjustLocation: null,
  adjustCurrentQty: 0,
  reopenMoveModal: false,
  groupCollapsed: {},
  catOrder: [],          // manual category order (stored in localStorage)
  allCategories: [],     // all unique categories from server
};

// ====== INIT ======
document.addEventListener('DOMContentLoaded', function() {
  try {
    var savedGroups = localStorage.getItem('inv_group_state');
    if (savedGroups) state.groupCollapsed = JSON.parse(savedGroups);
  } catch (_) {}
  try {
    var savedOrder = localStorage.getItem('inv_cat_order');
    if (savedOrder) state.catOrder = JSON.parse(savedOrder);
  } catch (_) {}
  refreshAll();
});

// ====== MOUSE WHEEL SCROLL FIX (GAS sandboxed-iframe bug) ======
// เบราว์เซอร์บางตัวหา scroll container ที่ถูกต้องไม่เจอเมื่อหน้าเว็บถูกเสิร์ฟ
// ผ่าน iframe แบบ sandbox ของ Google Apps Script ทำให้ mouse wheel ไม่เลื่อนหน้า
// (แต่ touch และการลาก scrollbar ยังทำงานปกติ เพราะไม่ผ่าน pipeline เดียวกัน)
// โค้ดนี้ดัก wheel event เองแล้วสั่งเลื่อน #app ด้วยมือแทน
(function() {
  var appEl = document.getElementById('app');
  if (!appEl) return;

  document.addEventListener('wheel', function(e) {
    // ถ้าเมาส์อยู่เหนือ modal ที่เปิดอยู่ (modal-sheet มี overflow-y:auto ของตัวเอง
    // และเป็น element ปกตินอก #app) ให้ปล่อยให้เบราว์เซอร์เลื่อน modal ตามปกติ
    if (e.target.closest && e.target.closest('.modal-sheet')) return;

    appEl.scrollTop += e.deltaY;
    e.preventDefault();
  }, { passive: false });
})();

async function refreshAll() {
  var btn = document.getElementById('refreshBtn');
  if (btn) { btn.innerHTML = '⏳'; btn.disabled = true; }
  try {
    // Load settings and inventory in parallel
    var [settingsRes, _] = await Promise.all([
      apiGet('/api/settings').catch(function(){ return { settings: {} }; }),
      loadInventory(),
    ]);
    if (settingsRes && settingsRes.settings) {
      state.settings = settingsRes.settings;
      updateAppTitles();
    }
    var el = document.getElementById('lastUpdate');
    if (el) el.textContent = 'อัปเดต ' + formatTime(new Date());
    var sideEl = document.getElementById('sidebarUpdate');
    if (sideEl) sideEl.textContent = 'อัปเดต ' + formatTime(new Date());
  } catch (e) {
    showToast('โหลดข้อมูลล้มเหลว: ' + e.message, 'error');
  } finally {
    if (btn) { btn.innerHTML = '🔄 รีเฟรช'; btn.disabled = false; }
  }
}

function updateAppTitles() {
  var company = state.settings.companyName || '';
  var companyEls = document.querySelectorAll('[data-company-name]');
  companyEls.forEach(function(el) { el.textContent = company; el.style.display = company ? '' : 'none'; });
}


// ====== LOAD DATA ======
async function loadInventory() {
  var data = await apiGet('/api/inventory');
  state.locations = data.locations || [];
  state.allLocations = data.locations || [];
  state.items = data.items || [];
  // Build allCategories from items
  var seen = {};
  state.items.forEach(function(it) {
    if (it.category && !seen[it.category]) { seen[it.category] = true; }
  });
  state.allCategories = Object.keys(seen);
  renderLocationCards();
  renderInventoryList();
  renderInventoryLocationFilter();
}

async function loadHistory(reset) {
  if (reset === undefined) reset = true;
  if (reset) { state.historyPage = 1; state.history = []; }
  var data = await apiGet('/api/history?page=' + state.historyPage + '&limit=30');
  state.historyTotal = data.total || 0;
  state.history = reset ? (data.history || []) : state.history.concat(data.history || []);
  renderHistoryList();
}

async function loadMoreHistory() {
  state.historyPage++;
  await loadHistory(false);
}

// ====== NAVIGATION ======
function switchPage(page) {
  document.querySelectorAll('.page').forEach(function(p) { p.classList.remove('active'); });
  document.querySelectorAll('.nav-btn').forEach(function(b) { b.classList.remove('active'); });
  document.querySelectorAll('.sidebar-btn').forEach(function(b) { b.classList.remove('active'); });
  var pageEl = document.getElementById('page-' + page);
  if (pageEl) pageEl.classList.add('active');
  var navEl = document.getElementById('nav-' + page);
  if (navEl) navEl.classList.add('active');
  var sBtn = document.getElementById('snav-' + page);
  if (sBtn) sBtn.classList.add('active');
  state.currentPage = page;
  if (page === 'history') loadHistory(true);
  window.scrollTo({ top: 0, behavior: 'smooth' });
}

// ====== LOCATION ICONS ======
function getLocIcon(loc) {
  if (!loc) return '📦';
  var name = typeof loc === 'string' ? loc : loc.name;
  var type = typeof loc === 'object' ? loc.type : null;
  if (name.includes('ร้านค้า') || name.includes('เช่า')) return '🏪';
  if (name.includes('ร้านซ่อม') || name.includes('ซ่อม')) return '🔧';
  if (name.includes('สูญหาย') || name.includes('หาย')) return '🚫';
  if (name.includes('จำหน่าย') || name.includes('ทิ้ง') || name.includes('ตัดออก')) return '🗑️';
  if (type === 'สโตร์') return '🏭';
  if (type === 'ไซต์งาน') return '🏗️';
  return '📦';
}
function getLocBadgeClass(type) {
  if (type === 'สโตร์') return 'badge-store';
  if (type === 'ไซต์งาน') return 'badge-site';
  return 'badge-other';
}
function getLocTypeLabel(type) {
  if (type === 'สโตร์') return 'สโตร์';
  if (type === 'ไซต์งาน') return 'ไซต์งาน';
  return 'อื่นๆ';
}

// ====== RENDER LOCATION CARDS ======
function renderLocationCards() {
  var grid = document.getElementById('locGridContent');
  var filtered = getFilteredLocations();
  if (filtered.length === 0) {
    grid.innerHTML = '<div style="grid-column:1/-1;text-align:center;padding:40px 20px;color:#64748b;font-size:14px;">ไม่พบสถานที่<br><small style="font-size:11px;">กด ⚙️ ตั้งค่า เพื่อเพิ่มสถานที่</small></div>';
    return;
  }
  grid.innerHTML = filtered.map(function(loc) {
    var isSource = state.sourceLocation === loc.name;
    var isDest = state.destLocation === loc.name;
    var activeCount = state.items.filter(function(it) { return (it.quantities[loc.name] || 0) > 0; }).length;
    var isExternal = loc.hideCount;

    return '<div class="loc-card ' + (isSource ? 'selected-source' : '') + ' ' + (isDest ? 'selected-dest' : '') + '"' +
      ' id="loc-card-' + encId(loc.name) + '" data-location="' + loc.name + '"' +
      ' draggable="true"' +
      ' ondragstart="onDragStart(event,\'' + esc(loc.name) + '\')"' +
      ' ondragend="onDragEnd(event)"' +
      ' ondragover="onDragOver(event)"' +
      ' ondragleave="onDragLeave(event)"' +
      ' ondrop="onDrop(event,\'' + esc(loc.name) + '\')"' +
      ' onclick="onCardClick(\'' + esc(loc.name) + '\')">' +
      '<div style="padding:14px 12px;">' +
      '<div style="display:flex;align-items:flex-start;justify-content:space-between;margin-bottom:10px;">' +
      '<span style="font-size:24px;">' + getLocIcon(loc) + '</span>' +
      '<span class="' + getLocBadgeClass(loc.type) + '" style="font-size:10px;font-weight:700;color:white;padding:3px 8px;border-radius:99px;">' + getLocTypeLabel(loc.type) + '</span>' +
      '</div>' +
      '<div style="font-size:13px;font-weight:700;color:#e2e8f0;line-height:1.3;margin-bottom:6px;">' + loc.name + '</div>' +
      (isExternal
        ? '<div style="font-size:11px;color:#64748b;">ภายนอกบริษัท</div>'
        : '<div style="font-size:11px;color:#64748b;">' + activeCount + ' รายการ</div>') +
      '</div></div>';
  }).join('');
}

function getFilteredLocations() {
  return state.locations.filter(function(loc) {
    if (state.locFilter === 'all') return true;
    if (state.locFilter === 'store') return loc.type === 'สโตร์';
    if (state.locFilter === 'site') return loc.type === 'ไซต์งาน';
    if (state.locFilter === 'other') return loc.type !== 'สโตร์' && loc.type !== 'ไซต์งาน';
    return true;
  });
}

function filterLocations(f) {
  state.locFilter = f;
  document.querySelectorAll('[id^="locFilter-"]').forEach(function(b) { b.classList.remove('active'); });
  var btn = document.getElementById('locFilter-' + f);
  if (btn) btn.classList.add('active');
  renderLocationCards();
}

// ====== DRAG & DROP ======
function onDragStart(e, name) {
  state.draggedCard = name;
  e.dataTransfer.effectAllowed = 'move';
  e.dataTransfer.setData('text/plain', name);
  setTimeout(function() {
    var c = document.getElementById('loc-card-' + encId(name));
    if (c) c.classList.add('dragging');
  }, 10);
}
function onDragEnd() {
  document.querySelectorAll('.loc-card').forEach(function(c) { c.classList.remove('dragging', 'drag-over'); });
}
function onDragOver(e) {
  e.preventDefault(); e.dataTransfer.dropEffect = 'move';
  if (e.currentTarget.dataset.location !== state.draggedCard) e.currentTarget.classList.add('drag-over');
}
function onDragLeave(e) { e.currentTarget.classList.remove('drag-over'); }
function onDrop(e, dest) {
  e.preventDefault(); e.currentTarget.classList.remove('drag-over');
  var src = state.draggedCard || e.dataTransfer.getData('text/plain');
  state.draggedCard = null;
  if (!src || src === dest) return;
  state.sourceLocation = src; state.destLocation = dest;
  openMoveModal();
}

// ====== TAP FLOW ======
function onCardClick(name) {
  if (!state.sourceLocation) {
    state.sourceLocation = name; state.destLocation = null;
    updateMoveStepBar(); renderLocationCards();
    showToast('เลือกต้นทาง: ' + name + ' ✅  แตะสถานที่ปลายทาง', 'info');
  } else if (state.sourceLocation === name) {
    cancelMove();
  } else {
    state.destLocation = name; renderLocationCards(); openMoveModal();
  }
}
function cancelMove() {
  state.sourceLocation = null; state.destLocation = null;
  updateMoveStepBar(); renderLocationCards();
}
function updateMoveStepBar() {
  var bar = document.getElementById('moveStepBar');
  var srcEl = document.getElementById('stepSourceName');
  var dstEl = document.getElementById('stepDestName');
  if (state.sourceLocation) {
    bar.style.display = 'block';
    if (srcEl) srcEl.textContent = state.sourceLocation;
    if (dstEl) dstEl.textContent = state.destLocation || 'แตะเลือก...';
  } else { bar.style.display = 'none'; }
}

// ====== MOVE MODAL ======
function openMoveModal() {
  var select = document.getElementById('moveItemSelect');
  document.getElementById('modalRouteInfo').textContent = state.sourceLocation + ' → ' + state.destLocation;
  updateMoveStepBar();
  var srcItems = state.items.filter(function(it) { return (it.quantities[state.sourceLocation] || 0) > 0; });
  select.innerHTML = '<option value="">-- เลือกรายการ --</option>' +
    srcItems.map(function(it) {
      return '<option value="' + esc(it.name) + '" data-qty="' + (it.quantities[state.sourceLocation] || 0) + '" data-unit="' + esc(it.unit) + '">' +
        it.name + ' (' + (it.quantities[state.sourceLocation] || 0) + ' ' + it.unit + ')</option>';
    }).join('');
  document.getElementById('moveQuantity').value = '';
  document.getElementById('moveCarrier').value = '';
  document.getElementById('moveRemark').value = '';
  document.getElementById('moveItemStock').style.display = 'none';
  var btn = document.getElementById('confirmMoveBtn');
  if (btn) { btn.disabled = false; btn.textContent = '✅ ยืนยัน'; }
  document.getElementById('moveModal').style.display = 'flex';
}
function onMoveItemChange() {
  var sel = document.getElementById('moveItemSelect');
  var stockDiv = document.getElementById('moveItemStock');
  if (sel.value) {
    var opt = sel.selectedOptions[0];
    stockDiv.style.display = 'block';
    stockDiv.textContent = '📍 ที่ ' + state.sourceLocation + ': มี ' + opt.dataset.qty + ' ' + opt.dataset.unit;
    document.getElementById('moveQuantity').max = opt.dataset.qty;
    document.getElementById('moveQuantity').focus();
  } else { stockDiv.style.display = 'none'; }
}
function closeMoveModal(e) {
  if (e && e.target !== document.getElementById('moveModal')) return;
  closeMoveModalDirect();
}
function closeMoveModalDirect() {
  document.getElementById('moveModal').style.display = 'none';
  cancelMove();
}
async function confirmMove() {
  var itemName = document.getElementById('moveItemSelect').value;
  var qty = document.getElementById('moveQuantity').value;
  var carrier = document.getElementById('moveCarrier').value;
  var remark = document.getElementById('moveRemark').value;
  var btn = document.getElementById('confirmMoveBtn');
  if (!itemName) { showToast('กรุณาเลือกสิ่งของ', 'error'); return; }
  if (!qty || Number(qty) <= 0) { showToast('กรุณาระบุจำนวน', 'error'); return; }
  btn.disabled = true; btn.textContent = '⏳ กำลังบันทึก...';
  try {
    var res = await apiPost('/api/inventory/move', {
      itemName: itemName, quantity: Number(qty),
      fromLocation: state.sourceLocation, toLocation: state.destLocation,
      carrier: carrier, receiver: '', reporter: carrier, remark: remark,
    });
    showToast(res.message, 'success');
    document.getElementById('moveModal').style.display = 'none';
    cancelMove(); await loadInventory();
  } catch (err) {
    showToast(err.message, 'error');
    btn.disabled = false; btn.textContent = '✅ ยืนยัน';
  }
}

// ====== ADD ITEM MODAL ======
function showAddItemModal(fromMove) {
  fromMove = fromMove || false;
  state.reopenMoveModal = fromMove;
  updateCategoryDatalist();
  ['newItemName', 'newItemCategory', 'newItemUnit', 'newItemNote'].forEach(function(id) {
    document.getElementById(id).value = '';
  });
  if (fromMove) document.getElementById('moveModal').style.display = 'none';
  document.getElementById('addItemModal').style.display = 'flex';
  setTimeout(function() { document.getElementById('newItemName').focus(); }, 100);
}
function updateCategoryDatalist() {
  var dl = document.getElementById('categoryList');
  if (!dl) return;
  dl.innerHTML = state.allCategories.map(function(c) {
    return '<option value="' + esc(c) + '">' + c + '</option>';
  }).join('');
}
function closeAddItemModal(e) {
  if (e && e.target !== document.getElementById('addItemModal')) return;
  document.getElementById('addItemModal').style.display = 'none';
  if (state.reopenMoveModal) { state.reopenMoveModal = false; setTimeout(openMoveModal, 100); }
}
async function confirmAddItem() {
  var name = document.getElementById('newItemName').value.trim();
  var category = document.getElementById('newItemCategory').value.trim();
  var unit = document.getElementById('newItemUnit').value.trim();
  var note = document.getElementById('newItemNote').value.trim();
  if (!name) { showToast('กรุณาระบุชื่อสิ่งของ', 'error'); return; }
  try {
    var res = await apiPost('/api/inventory/add-item', { name: name, category: category, unit: unit, note: note });
    showToast(res.message, 'success');
    document.getElementById('addItemModal').style.display = 'none';
    await loadInventory();
    if (state.reopenMoveModal) { state.reopenMoveModal = false; setTimeout(openMoveModal, 200); }
  } catch (err) { showToast(err.message, 'error'); }
}

// ====== INVENTORY PAGE ======
function renderInventoryLocationFilter() {
  var c = document.getElementById('invLocFilter');
  c.innerHTML = '<button class="filter-pill active" id="invLoc-all" onclick="filterInventoryByLocation(\'all\')">ทั้งหมด</button>' +
    state.locations.map(function(l) {
      return '<button class="filter-pill" id="invLoc-' + encId(l.name) + '" onclick="filterInventoryByLocation(\'' + esc(l.name) + '\')">' + l.name + '</button>';
    }).join('');
}
function filterInventoryByLocation(name) {
  state.invLocFilter = name;
  document.querySelectorAll('[id^="invLoc-"]').forEach(function(b) { b.classList.remove('active'); });
  var btn = document.getElementById('invLoc-' + (name === 'all' ? 'all' : encId(name)));
  if (btn) btn.classList.add('active');
  renderInventoryList();
}
function filterInventory() {
  state.searchTerm = document.getElementById('searchInput').value.toLowerCase().trim();
  renderInventoryList();
}

// ====== CATEGORY ORDER ======
function getCatOrder() { return state.catOrder; }
function saveCatOrder() {
  try { localStorage.setItem('inv_cat_order', JSON.stringify(state.catOrder)); } catch (_) {}
}
function getSortedCats(cats) {
  // Put ordered cats first, then remaining alphabetically
  var order = state.catOrder;
  var inOrder = order.filter(function(c) { return cats.indexOf(c) !== -1; });
  var notInOrder = cats.filter(function(c) { return order.indexOf(c) === -1; }).sort();
  return inOrder.concat(notInOrder);
}
function moveCatUp(cat) {
  var order = getSortedCats(Object.keys(getGrouped()));
  var idx = order.indexOf(cat);
  if (idx <= 0) return;
  state.catOrder = order.slice();
  // ensure all cats are in state.catOrder
  state.catOrder = order;
  var tmp = state.catOrder[idx]; state.catOrder[idx] = state.catOrder[idx - 1]; state.catOrder[idx - 1] = tmp;
  saveCatOrder(); renderInventoryList();
}
function moveCatDown(cat) {
  var order = getSortedCats(Object.keys(getGrouped()));
  var idx = order.indexOf(cat);
  if (idx < 0 || idx >= order.length - 1) return;
  state.catOrder = order.slice();
  var tmp = state.catOrder[idx]; state.catOrder[idx] = state.catOrder[idx + 1]; state.catOrder[idx + 1] = tmp;
  saveCatOrder(); renderInventoryList();
}
function getGrouped() {
  var items = getFilteredItems();
  var grouped = {};
  items.forEach(function(it) {
    var cat = it.category || 'ไม่มีหมวดหมู่';
    if (!grouped[cat]) grouped[cat] = [];
    grouped[cat].push(it);
  });
  return grouped;
}
function getFilteredItems() {
  var items = state.items;
  if (state.searchTerm) {
    items = items.filter(function(it) {
      return it.name.toLowerCase().includes(state.searchTerm) || it.category.toLowerCase().includes(state.searchTerm);
    });
  }
  if (state.invLocFilter !== 'all') {
    items = items.filter(function(it) { return (it.quantities[state.invLocFilter] || 0) > 0; });
  }
  return items;
}

function renderInventoryList() {
  var container = document.getElementById('inventoryList');
  var items = getFilteredItems();
  if (items.length === 0) {
    container.innerHTML = '<div class="glass-card" style="text-align:center;padding:40px;color:#64748b;">ไม่พบรายการ</div>';
    return;
  }
  var grouped = {};
  items.forEach(function(it) {
    var cat = it.category || 'ไม่มีหมวดหมู่';
    if (!grouped[cat]) grouped[cat] = [];
    grouped[cat].push(it);
  });
  var sortedCats = getSortedCats(Object.keys(grouped));
  var totalCats = sortedCats.length;

  container.innerHTML = sortedCats.map(function(cat, catIdx) {
    var catItems = grouped[cat];
    var collapsed = state.groupCollapsed[cat] === true;
    var isFirst = catIdx === 0;
    var isLast = catIdx === totalCats - 1;
    return '<div style="margin-bottom:12px;">' +
      '<div class="group-header" onclick="toggleGroup(\'' + esc(cat) + '\')">' +
      '<div class="group-title">' + cat + ' <span style="color:#475569;font-weight:400;font-size:10px;">(' + catItems.length + ')</span></div>' +
      '<div style="display:flex;gap:4px;align-items:center;" onclick="event.stopPropagation();">' +
      (!isFirst ? '<button class="cat-order-btn" onclick="moveCatUp(\'' + esc(cat) + '\')" title="เลื่อนขึ้น">↑</button>' : '<span style="width:24px;"></span>') +
      (!isLast ? '<button class="cat-order-btn" onclick="moveCatDown(\'' + esc(cat) + '\')" title="เลื่อนลง">↓</button>' : '<span style="width:24px;"></span>') +
      '</div>' +
      '<span class="group-chevron ' + (collapsed ? 'collapsed' : '') + '">▼</span>' +
      '</div>' +
      '<div class="glass-card" id="group-' + encId(cat) + '" style="' + (collapsed ? 'display:none;' : '') + '">' +
      catItems.map(function(it) { return renderInventoryRow(it); }).join('') +
      '</div></div>';
  }).join('');
}

function toggleGroup(cat) {
  var el = document.getElementById('group-' + encId(cat));
  if (!el) return;
  var chevron = el.previousElementSibling ? el.previousElementSibling.querySelector('.group-chevron') : null;
  var isCollapsed = el.style.display === 'none';
  el.style.display = isCollapsed ? '' : 'none';
  if (chevron) chevron.classList.toggle('collapsed', !isCollapsed);
  state.groupCollapsed[cat] = !isCollapsed;
  try { localStorage.setItem('inv_group_state', JSON.stringify(state.groupCollapsed)); } catch (_) {}
}

function renderInventoryRow(item) {
  var qty = state.invLocFilter !== 'all' ? (item.quantities[state.invLocFilter] || 0) :
    Object.values(item.quantities).reduce(function(s, q) { return s + Math.max(0, q || 0); }, 0);
  var locCount = Object.values(item.quantities).filter(function(q) { return q > 0; }).length;
  var sub = state.invLocFilter !== 'all' ? state.invLocFilter : locCount + ' สถานที่';

  // Qty badge style (inline - no CSS class dependency)
  var qtyBg, qtyColor, qtyBorder;
  if (qty > 0) {
    qtyBg = 'rgba(34,197,94,0.15)'; qtyColor = '#4ade80'; qtyBorder = '1px solid rgba(34,197,94,0.2)';
  } else if (qty < 0) {
    qtyBg = 'rgba(239,68,68,0.15)'; qtyColor = '#f87171'; qtyBorder = '1px solid rgba(239,68,68,0.2)';
  } else {
    qtyBg = 'rgba(51,65,85,0.3)'; qtyColor = '#64748b'; qtyBorder = '1px solid transparent';
  }

  var adjustBtn = 'event.stopPropagation();showAdjustModal(\'' +
    esc(item.name) + '\',\'' +
    esc(state.invLocFilter !== 'all' ? state.invLocFilter : '') + '\')';

  return (
    // Row container: flex, no overflow, fixed height layout
    '<div onclick="showItemDetail(\'' + esc(item.name) + '\')" style="' +
      'display:flex;align-items:center;padding:11px 12px;' +
      'border-bottom:1px solid rgba(51,65,85,0.3);cursor:pointer;' +
      'gap:10px;width:100%;box-sizing:border-box;' +
      'transition:background .15s;-webkit-tap-highlight-color:rgba(59,130,246,0.1);">' +

    // LEFT: name column - flex:1 min-width:0 so it shrinks and truncates
    '<div style="flex:1;min-width:0;overflow:hidden;">' +
    '<div style="font-size:13px;font-weight:600;color:#e2e8f0;' +
      'overflow:hidden;text-overflow:ellipsis;white-space:nowrap;">' + item.name + '</div>' +
    '<div style="font-size:11px;color:#64748b;margin-top:2px;white-space:nowrap;">' + sub + '</div>' +
    '</div>' +

    // RIGHT: qty + button - flex-shrink:0 so it never gets compressed
    '<div style="display:flex;align-items:center;gap:8px;flex-shrink:0;">' +
    '<div style="text-align:center;">' +
    '<span style="display:inline-block;min-width:40px;text-align:center;' +
      'padding:4px 8px;border-radius:8px;font-size:14px;font-weight:800;' +
      'font-family:Outfit,sans-serif;' +
      'background:' + qtyBg + ';color:' + qtyColor + ';border:' + qtyBorder + ';">' + qty + '</span>' +
    '<div style="font-size:10px;color:#64748b;margin-top:2px;">' + item.unit + '</div>' +
    '</div>' +
    '<button onclick="' + adjustBtn + '" style="' +
      'background:rgba(217,119,6,0.15);border:1px solid rgba(217,119,6,0.3);' +
      'color:#fbbf24;padding:8px;border-radius:9px;cursor:pointer;' +
      'font-size:14px;flex-shrink:0;line-height:1;" title="ปรับยอด">⚖️</button>' +
    '</div>' +

    '</div>'
  );
}


// ====== ITEM DETAIL MODAL ======
function showItemDetail(itemName) {
  var item = state.items.find(function(it) { return it.name === itemName; });
  if (!item) return;
  document.getElementById('detailItemName').textContent = item.name;
  document.getElementById('detailItemCat').textContent = (item.category || '-') + ' · ' + item.unit;
  var total = Object.values(item.quantities).reduce(function(s, q) { return s + Math.max(0, q || 0); }, 0);
  document.getElementById('detailTotalBadge').textContent = 'รวม ' + total + ' ' + item.unit;
  document.getElementById('detailLocationList').innerHTML = state.locations.map(function(loc) {
    var qty = item.quantities[loc.name] || 0;
    var qtyClass = qty > 0 ? 'qty-positive' : (qty < 0 ? 'qty-negative' : 'qty-zero');
    return '<div style="display:flex;align-items:center;padding:12px 14px;background:rgba(30,41,59,0.6);border-radius:12px;gap:12px;">' +
      '<span style="font-size:18px;">' + getLocIcon(loc) + '</span>' +
      '<div style="flex:1;min-width:0;"><div style="font-size:13px;font-weight:600;color:#e2e8f0;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;">' + loc.name + '</div>' +
      '<div style="font-size:11px;color:#64748b;">' + loc.type + '</div></div>' +
      '<div style="text-align:center;flex-shrink:0;"><span class="qty-badge ' + qtyClass + '">' + qty + '</span>' +
      '<div style="font-size:10px;color:#64748b;">' + item.unit + '</div></div>' +
      '<button onclick="showAdjustModal(\'' + esc(item.name) + '\',\'' + esc(loc.name) + '\');closeItemDetailModal();" class="adj-btn">⚖️</button>' +
      '</div>';
  }).join('');
  document.getElementById('itemDetailModal').style.display = 'flex';
}
function closeItemDetailModal(e) {
  if (e && e.target !== document.getElementById('itemDetailModal')) return;
  document.getElementById('itemDetailModal').style.display = 'none';
}

// ====== ADJUST MODAL ======
function showAdjustModal(itemName, locationName) {
  if (!locationName) { showItemDetail(itemName); return; }
  var item = state.items.find(function(it) { return it.name === itemName; });
  if (!item) return;
  var currentQty = item.quantities[locationName] || 0;
  state.adjustItem = itemName; state.adjustLocation = locationName; state.adjustCurrentQty = currentQty;
  document.getElementById('adjustItemInfo').textContent = itemName + ' · ' + locationName;
  document.getElementById('adjustCurrentQty').textContent = currentQty;
  document.getElementById('adjustUnit').textContent = item.unit;
  document.getElementById('adjustNewQty').value = '';
  document.getElementById('adjustAdjuster').value = '';
  document.getElementById('adjustRemark').value = '';
  document.getElementById('adjustDiffDisplay').style.display = 'none';
  document.getElementById('itemDetailModal').style.display = 'none';
  document.getElementById('adjustModal').style.display = 'flex';
  setTimeout(function() { document.getElementById('adjustNewQty').focus(); }, 100);
}
function calcAdjustDiff() {
  var val = document.getElementById('adjustNewQty').value;
  var diffDiv = document.getElementById('adjustDiffDisplay');
  var diffText = document.getElementById('adjustDiffText');
  if (val === '') { diffDiv.style.display = 'none'; return; }
  var diff = Number(val) - state.adjustCurrentQty;
  diffDiv.style.display = 'block';
  if (diff > 0) {
    diffDiv.className = 'diff-box diff-pos';
    diffText.textContent = '✅ เพิ่ม +' + diff + ' (จาก ' + state.adjustCurrentQty + ' → ' + Number(val) + ')';
  } else if (diff < 0) {
    diffDiv.className = 'diff-box diff-neg';
    diffText.textContent = '⚠️ ลด ' + diff + ' (จาก ' + state.adjustCurrentQty + ' → ' + Number(val) + ')';
  } else {
    diffDiv.className = 'diff-box diff-zero';
    diffText.textContent = 'ℹ️ ยอดเท่าเดิม (' + Number(val) + ')';
  }
}
function closeAdjustModal(e) {
  if (e && e.target !== document.getElementById('adjustModal')) return;
  document.getElementById('adjustModal').style.display = 'none';
}
async function confirmAdjust() {
  var newQty = document.getElementById('adjustNewQty').value;
  var adjuster = document.getElementById('adjustAdjuster').value.trim();
  var remark = document.getElementById('adjustRemark').value.trim();
  if (newQty === '' || Number(newQty) < 0) { showToast('กรุณาระบุจำนวน', 'error'); return; }
  if (!adjuster) { showToast('กรุณาระบุชื่อผู้ปรับยอด', 'error'); return; }
  try {
    var res = await apiPost('/api/inventory/adjust', {
      itemName: state.adjustItem, location: state.adjustLocation,
      newQuantity: Number(newQty), adjusterName: adjuster, remark: remark,
    });
    showToast(res.message, 'success');
    document.getElementById('adjustModal').style.display = 'none';
    await loadInventory();
  } catch (err) { showToast(err.message, 'error'); }
}

// ====== HISTORY PAGE ======
function renderHistoryList() {
  var container = document.getElementById('historyList');
  var countEl = document.getElementById('historyCount');
  var loadMoreEl = document.getElementById('historyLoadMore');
  if (countEl) countEl.textContent = state.historyTotal + ' รายการ';
  if (state.history.length === 0) {
    container.innerHTML = '<div style="text-align:center;padding:60px 20px;color:#64748b;"><div style="font-size:40px;margin-bottom:12px;">📋</div><div>ยังไม่มีประวัติรายการ</div></div>';
    if (loadMoreEl) loadMoreEl.style.display = 'none';
    return;
  }
  container.innerHTML = state.history.map(function(h, idx) {
    var isMove = h.type === 'ขนย้าย';
    var isFirst = idx === 0;
    var dotColor = isMove ? '#3b82f6' : '#f59e0b';
    var dotEmoji = isMove ? '🚛' : '⚖️';
    var dateStr = h.date ? formatDate(new Date(h.date)) : '-';
    var hasBalance = h.balanceFrom !== null && h.balanceFrom !== undefined;
    var hasBothBalance = hasBalance && h.balanceTo !== null && h.balanceTo !== undefined;
    var balanceHtml = '';
    if (isMove && hasBothBalance) {
      balanceHtml = '<div style="display:flex;gap:8px;margin-top:8px;flex-wrap:wrap;">' +
        '<div style="font-size:11px;background:rgba(15,23,42,0.6);border-radius:8px;padding:4px 10px;color:#94a3b8;"><span style="color:#64748b;">ต้นทาง:</span> <span style="color:#f87171;font-weight:700;">' + h.balanceFrom + '</span></div>' +
        '<div style="font-size:11px;background:rgba(15,23,42,0.6);border-radius:8px;padding:4px 10px;color:#94a3b8;"><span style="color:#64748b;">ปลายทาง:</span> <span style="color:#4ade80;font-weight:700;">' + h.balanceTo + '</span></div>' +
        '</div>';
    } else if (!isMove && hasBalance) {
      balanceHtml = '<div style="margin-top:8px;"><div style="font-size:11px;background:rgba(15,23,42,0.6);border-radius:8px;padding:4px 10px;color:#94a3b8;display:inline-block;">' +
        '<span style="color:#64748b;">ก่อน:</span> <span style="font-weight:700;">' + h.balanceFrom + '</span>' +
        '<span style="color:#64748b;"> → หลัง:</span> <span style="color:#fbbf24;font-weight:700;">' + h.balanceTo + '</span>' +
        '</div></div>';
    }
    var metaHtml = (h.reporter || h.carrier || h.remark) ?
      '<div style="font-size:11px;color:#64748b;margin-top:8px;display:flex;gap:10px;flex-wrap:wrap;">' +
      (h.reporter ? '<span>👤 ' + h.reporter + '</span>' : '') +
      (h.carrier && h.carrier !== h.reporter ? '<span>🚛 ' + h.carrier + '</span>' : '') +
      (h.remark ? '<span>📝 ' + h.remark + '</span>' : '') +
      '</div>' : '';
    var undoHtml = isFirst ?
      '<div style="margin-top:10px;padding-top:10px;border-top:1px solid rgba(51,65,85,0.4);">' +
      '<button onclick="showUndoModal()" style="background:rgba(239,68,68,0.12);border:1px solid rgba(239,68,68,0.3);color:#f87171;padding:7px 14px;border-radius:10px;cursor:pointer;font-size:12px;font-family:\'Sarabun\',sans-serif;font-weight:600;">🔙 ยกเลิกรายการนี้</button>' +
      '</div>' : '';
    var routeHtml = isMove ?
      '<div style="display:flex;align-items:center;gap:6px;background:rgba(15,23,42,0.5);border-radius:10px;padding:8px 12px;overflow:hidden;">' +
      '<span style="font-size:12px;color:#60a5fa;font-weight:600;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;max-width:110px;">' + h.fromLocation + '</span>' +
      '<span style="color:#475569;font-size:14px;flex-shrink:0;">→</span>' +
      '<span style="font-size:12px;color:#4ade80;font-weight:600;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;max-width:110px;">' + h.toLocation + '</span>' +
      '</div>' :
      '<div style="background:rgba(15,23,42,0.5);border-radius:10px;padding:8px 12px;">' +
      '<span style="font-size:12px;color:#fbbf24;font-weight:600;">' + h.fromLocation + '</span>' +
      '</div>';
    return '<div class="timeline-item" style="margin-bottom:12px;">' +
      '<div class="timeline-dot" style="background:' + dotColor + '20;color:' + dotColor + ';border:2px solid ' + dotColor + '40;">' + dotEmoji + '</div>' +
      '<div class="glass-card" style="padding:14px;flex:1;min-width:0;">' +
      '<div style="display:flex;align-items:flex-start;justify-content:space-between;gap:8px;margin-bottom:8px;">' +
      '<div style="flex:1;min-width:0;">' +
      '<span style="font-size:11px;font-weight:700;color:' + dotColor + ';text-transform:uppercase;letter-spacing:.05em;">' + h.type + '</span>' +
      '<div style="font-size:14px;font-weight:700;color:#e2e8f0;margin-top:2px;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;">' + h.itemName + '</div>' +
      '</div>' +
      '<div style="text-align:right;flex-shrink:0;">' +
      '<div style="font-size:18px;font-weight:800;color:#e2e8f0;font-family:\'Outfit\',sans-serif;">' + h.quantity + '</div>' +
      '<div style="font-size:10px;color:#64748b;">' + dateStr + '</div>' +
      '</div></div>' + routeHtml + balanceHtml + metaHtml + undoHtml +
      '</div></div>';
  }).join('');
  if (loadMoreEl) loadMoreEl.style.display = state.history.length < state.historyTotal ? 'block' : 'none';
}

// ====== UNDO MODAL ======
function showUndoModal() {
  var h = state.history[0];
  if (!h) return;
  document.getElementById('undoInfo').innerHTML =
    '<div><span style="color:#94a3b8;">ประเภท:</span> <strong>' + h.type + '</strong></div>' +
    '<div><span style="color:#94a3b8;">รายการ:</span> <strong>' + h.itemName + '</strong></div>' +
    '<div><span style="color:#94a3b8;">จำนวน:</span> <strong>' + h.quantity + '</strong></div>' +
    (h.type === 'ขนย้าย' ?
      '<div><span style="color:#94a3b8;">เส้นทาง:</span> <strong>' + h.fromLocation + ' → ' + h.toLocation + '</strong></div>' :
      '<div><span style="color:#94a3b8;">สถานที่:</span> <strong>' + h.fromLocation + '</strong></div>') +
    '<div><span style="color:#94a3b8;">บันทึกเมื่อ:</span> ' + (h.date ? formatDate(new Date(h.date)) : '-') + '</div>';
  document.getElementById('undoModal').style.display = 'flex';
}
function closeUndoModal(e) {
  if (e && e.target !== document.getElementById('undoModal')) return;
  document.getElementById('undoModal').style.display = 'none';
}
async function confirmUndo() {
  var btn = document.getElementById('confirmUndoBtn');
  btn.disabled = true; btn.textContent = '⏳ กำลังยกเลิก...';
  try {
    var res = await apiPost('/api/history/undo', {});
    showToast(res.message, 'success');
    document.getElementById('undoModal').style.display = 'none';
    await loadInventory(); await loadHistory(true);
  } catch (err) { showToast(err.message, 'error'); }
  finally { btn.disabled = false; btn.textContent = '🔙 ยืนยันการยกเลิก'; }
}

// ====== SETTINGS MODAL ======
async function showSettingsModal() {
  document.getElementById('settingsModal').style.display = 'flex';
  // Also load all locations for the location section
  try {
    var data = await apiGet('/api/locations');
    state.allLocations = data.locations || [];
    renderLocationManageList();
  } catch (err) {
    showToast('โหลดสถานที่ล้มเหลว: ' + err.message, 'error');
    state.allLocations = state.locations.slice();
    renderLocationManageList();
  }
  // Load categories
  try {
    var catData = await apiGet('/api/categories');
    if (catData.categories) {
      state.allCategories = catData.categories;
      renderCategoryManageList();
    }
  } catch (err) {
    renderCategoryManageList();
  }
}

function closeSettingsModal(e) {
  if (e && e.target !== document.getElementById('settingsModal')) return;
  document.getElementById('settingsModal').style.display = 'none';
}

// ---- Category management ----
function renderCategoryManageList() {
  var container = document.getElementById('categoryManageList');
  if (!container) return;
  if (state.allCategories.length === 0) {
    container.innerHTML = '<div style="color:#64748b;font-size:13px;padding:12px;">ยังไม่มีหมวดหมู่</div>';
    return;
  }
  container.innerHTML = state.allCategories.map(function(cat) {
    return '<div class="cat-manage-row">' +
      '<div style="flex:1;font-size:13px;font-weight:600;color:#e2e8f0;">📂 ' + cat + '</div>' +
      '<button onclick="startRenameCat(\'' + esc(cat) + '\')" style="background:rgba(59,130,246,0.15);border:1px solid rgba(59,130,246,0.3);color:#60a5fa;padding:6px 12px;border-radius:9px;cursor:pointer;font-size:12px;font-family:\'Sarabun\',sans-serif;">✏️ เปลี่ยนชื่อ</button>' +
      '</div>';
  }).join('');
}
function startRenameCat(oldName) {
  var newName = prompt('เปลี่ยนชื่อหมวดหมู่ "' + oldName + '" เป็น:', oldName);
  if (!newName || newName.trim() === '' || newName.trim() === oldName) return;
  apiPost('/api/categories/rename', { oldName: oldName, newName: newName.trim() })
    .then(function(res) {
      showToast(res.message, 'success');
      return loadInventory();
    })
    .then(function() {
      state.allCategories = state.allCategories.map(function(c) { return c === oldName ? newName.trim() : c; });
      // Update catOrder too
      state.catOrder = state.catOrder.map(function(c) { return c === oldName ? newName.trim() : c; });
      saveCatOrder();
      renderCategoryManageList();
      updateCategoryDatalist();
    })
    .catch(function(err) { showToast(err.message, 'error'); });
}

// ---- Location management ----
function renderLocationManageList() {
  var container = document.getElementById('locationManageList');
  if (!container) return;
  var allLocs = state.allLocations;
  if (allLocs.length === 0) {
    container.innerHTML = '<div style="text-align:center;color:#64748b;padding:20px;font-size:13px;">ยังไม่มีสถานที่</div>';
    return;
  }
  container.innerHTML = allLocs.map(function(loc) {
    var isActive = !loc.archived;
    return '<div class="loc-manage-row">' +
      '<span style="font-size:20px;">' + getLocIcon(loc) + '</span>' +
      '<div style="flex:1;min-width:0;">' +
      '<div style="font-size:13px;font-weight:600;color:#e2e8f0;overflow:hidden;text-overflow:ellipsis;">' + loc.name + '</div>' +
      '<div style="font-size:11px;color:#64748b;">' + getLocTypeLabel(loc.type) + '</div>' +
      '</div>' +
      '<label class="toggle-switch">' +
      '<input type="checkbox" ' + (isActive ? 'checked' : '') + ' onchange="toggleArchiveLocation(\'' + esc(loc.name) + '\', this.checked)" />' +
      '<span class="toggle-slider"></span>' +
      '</label></div>';
  }).join('');
}
async function toggleArchiveLocation(name, active) {
  try {
    await apiPost('/api/locations/archive', { name: name, archived: !active });
    showToast(active ? 'แสดง "' + name + '" แล้ว' : 'ซ่อน "' + name + '" แล้ว', 'success');
    var data = await apiGet('/api/locations');
    state.allLocations = data.locations || [];
    renderLocationManageList();
    await loadInventory();
  } catch (err) { showToast(err.message, 'error'); renderLocationManageList(); }
}
async function confirmAddLocation() {
  var name = document.getElementById('newLocName').value.trim();
  var type = document.getElementById('newLocType').value;
  if (!name) { showToast('กรุณาระบุชื่อสถานที่', 'error'); return; }
  var btn = document.getElementById('addLocBtn');
  if (btn) { btn.disabled = true; btn.textContent = '⏳ กำลังเพิ่ม...'; }
  try {
    var res = await apiPost('/api/locations/add', { name: name, type: type });
    showToast(res.message, 'success');
    document.getElementById('newLocName').value = '';
    var data = await apiGet('/api/locations');
    state.allLocations = data.locations || [];
    renderLocationManageList();
    await loadInventory();
  } catch (err) { showToast(err.message, 'error'); }
  finally { if (btn) { btn.disabled = false; btn.textContent = '✅ เพิ่มสถานที่'; } }
}

// ====== TOAST ======
function showToast(message, type) {
  type = type || 'info';
  var c = document.getElementById('toastContainer');
  var t = document.createElement('div');
  t.className = 'toast toast-' + type;
  var icon = type === 'success' ? '✅' : type === 'error' ? '❌' : 'ℹ️';
  t.innerHTML = '<span>' + icon + '</span><span>' + message + '</span>';
  c.appendChild(t);
  setTimeout(function() {
    t.style.opacity = '0'; t.style.transition = 'opacity .3s';
    setTimeout(function() { t.remove(); }, 300);
  }, 3500);
}

// ====== HELPERS ======
function esc(str) {
  return String(str || '').replace(/\\/g, '\\\\').replace(/'/g, "\\'").replace(/"/g, '&quot;');
}
function encId(name) {
  return encodeURIComponent(String(name || '')).replace(/%/g, '_').replace(/\./g, '_');
}
function formatDate(d) {
  if (!(d instanceof Date) || isNaN(d)) return '-';
  var pad = function(n) { return String(n).padStart(2, '0'); };
  return pad(d.getDate()) + '/' + pad(d.getMonth()+1) + '/' + (d.getFullYear()+543) + ' ' + pad(d.getHours()) + ':' + pad(d.getMinutes());
}
function formatTime(d) {
  if (!(d instanceof Date) || isNaN(d)) return '';
  var pad = function(n) { return String(n).padStart(2, '0'); };
  return pad(d.getHours()) + ':' + pad(d.getMinutes()) + ' น.';
}

// Legacy alias
function showLocationModal() { showSettingsModal(); }
function closeLocationModal(e) { closeSettingsModal(e); }

